croc_fio_test1.txt
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.3
Starting 2 processes

random-read: (groupid=0, jobs=1): err= 0: pid=2102: Wed Nov 29 08:01:27 2017
  read : io=131072KB, bw=1598.2KB/s, iops=399, runt= 82015msec
    clat (usec): min=298, max=46566, avg=2499.94, stdev=893.16
     lat (usec): min=298, max=46567, avg=2500.17, stdev=893.16
    clat percentiles (usec):
     |  1.00th=[  414],  5.00th=[ 1560], 10.00th=[ 2352], 20.00th=[ 2384],
     | 30.00th=[ 2416], 40.00th=[ 2416], 50.00th=[ 2480], 60.00th=[ 2512],
     | 70.00th=[ 2544], 80.00th=[ 2544], 90.00th=[ 2576], 95.00th=[ 3376],
     | 99.00th=[ 4448], 99.50th=[ 7520], 99.90th=[10816], 99.95th=[14528],
     | 99.99th=[34560]
    bw (KB  /s): min= 1298, max= 1628, per=100.00%, avg=1598.96, stdev=24.07
    lat (usec) : 500=1.70%, 750=0.87%, 1000=0.03%
    lat (msec) : 2=3.16%, 4=93.08%, 10=0.99%, 20=0.13%, 50=0.03%
  cpu          : usr=0.17%, sys=0.77%, ctx=32841, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0
random-write: (groupid=0, jobs=1): err= 0: pid=2103: Wed Nov 29 08:01:27 2017
  write: io=131072KB, bw=492752KB/s, iops=123187, runt=   266msec
    clat (usec): min=1, max=483, avg= 2.16, stdev= 6.00
     lat (usec): min=1, max=484, avg= 2.28, stdev= 6.01
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[    5], 99.50th=[    6], 99.90th=[   30], 99.95th=[   37],
     | 99.99th=[  370]
    lat (usec) : 2=15.42%, 4=81.40%, 10=2.82%, 20=0.16%, 50=0.15%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.02%
  cpu          : usr=10.57%, sys=37.74%, ctx=97, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=1598KB/s, minb=1598KB/s, maxb=1598KB/s, mint=82015msec, maxt=82015msec
  WRITE: io=131072KB, aggrb=492751KB/s, minb=492751KB/s, maxb=492751KB/s, mint=266msec, maxt=266msec

Disk stats (read/write):
    dm-0: ios=32743/295, merge=0/0, ticks=81400/11704, in_queue=93116, util=99.30%, aggrios=32769/777, aggrmerge=0/15, aggrticks=81444/32344, aggrin_queue=113776, aggrutil=99.23%
  vda: ios=32769/777, merge=0/15, ticks=81444/32344, in_queue=113776, util=99.23%