croc_fio_test2.txt
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.3
Starting 2 processes
random-read: Laying out IO file(s) (1 file(s) / 128MB)
random-write: Laying out IO file(s) (1 file(s) / 128MB)

random-read: (groupid=0, jobs=1): err= 0: pid=1245: Wed Nov 29 08:31:43 2017
  read : io=131072KB, bw=1600.7KB/s, iops=400, runt= 81889msec
    clat (usec): min=311, max=47003, avg=2496.06, stdev=822.15
     lat (usec): min=311, max=47003, avg=2496.29, stdev=822.15
    clat percentiles (usec):
     |  1.00th=[  438],  5.00th=[ 1560], 10.00th=[ 2352], 20.00th=[ 2384],
     | 30.00th=[ 2416], 40.00th=[ 2416], 50.00th=[ 2480], 60.00th=[ 2512],
     | 70.00th=[ 2544], 80.00th=[ 2544], 90.00th=[ 2608], 95.00th=[ 3376],
     | 99.00th=[ 3824], 99.50th=[ 6368], 99.90th=[10304], 99.95th=[12864],
     | 99.99th=[36096]
    bw (KB  /s): min= 1467, max= 1924, per=100.00%, avg=1601.50, stdev=28.77
    lat (usec) : 500=1.43%, 750=0.77%, 1000=0.02%
    lat (msec) : 2=3.58%, 4=93.29%, 10=0.79%, 20=0.10%, 50=0.03%
  cpu          : usr=0.18%, sys=0.75%, ctx=32837, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0
random-write: (groupid=0, jobs=1): err= 0: pid=1246: Wed Nov 29 08:31:43 2017
  write: io=131072KB, bw=1280.0MB/s, iops=327680, runt=   100msec
    clat (usec): min=1, max=67, avg= 2.15, stdev= 1.39
     lat (usec): min=1, max=68, avg= 2.29, stdev= 1.45
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[    4], 99.50th=[    5], 99.90th=[   28], 99.95th=[   31],
     | 99.99th=[   36]
    lat (usec) : 2=6.59%, 4=91.40%, 10=1.62%, 20=0.21%, 50=0.19%
    lat (usec) : 100=0.01%
  cpu          : usr=32.32%, sys=64.65%, ctx=92, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=1600KB/s, minb=1600KB/s, maxb=1600KB/s, mint=81889msec, maxt=81889msec
  WRITE: io=131072KB, aggrb=1280.0MB/s, minb=1280.0MB/s, maxb=1280.0MB/s, mint=100msec, maxt=100msec

Disk stats (read/write):
    dm-0: ios=32709/160, merge=0/0, ticks=81172/6832, in_queue=88008, util=99.25%, aggrios=32768/399, aggrmerge=0/12, aggrticks=81256/19412, aggrin_queue=100644, aggrutil=99.14%
  vda: ios=32768/399, merge=0/12, ticks=81256/19412, in_queue=100644, util=99.14%