croc_fio_test3.txt
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.3
Starting 2 processes
random-read: Laying out IO file(s) (1 file(s) / 128MB)
random-write: Laying out IO file(s) (1 file(s) / 128MB)

random-read: (groupid=0, jobs=1): err= 0: pid=1226: Wed Nov 29 08:41:32 2017
  read : io=131072KB, bw=1602.2KB/s, iops=400, runt= 81817msec
    clat (usec): min=317, max=18088, avg=2493.93, stdev=680.35
     lat (usec): min=317, max=18089, avg=2494.15, stdev=680.35
    clat percentiles (usec):
     |  1.00th=[  434],  5.00th=[ 1592], 10.00th=[ 2352], 20.00th=[ 2384],
     | 30.00th=[ 2416], 40.00th=[ 2416], 50.00th=[ 2480], 60.00th=[ 2512],
     | 70.00th=[ 2544], 80.00th=[ 2544], 90.00th=[ 2576], 95.00th=[ 3408],
     | 99.00th=[ 4048], 99.50th=[ 6752], 99.90th=[10048], 99.95th=[10944],
     | 99.99th=[16768]
    bw (KB  /s): min= 1564, max= 1924, per=100.00%, avg=1602.90, stdev=26.00
    lat (usec) : 500=1.42%, 750=0.81%, 1000=0.01%
    lat (msec) : 2=3.48%, 4=93.28%, 10=0.90%, 20=0.10%
  cpu          : usr=0.16%, sys=0.78%, ctx=32820, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0
random-write: (groupid=0, jobs=1): err= 0: pid=1227: Wed Nov 29 08:41:32 2017
  write: io=131072KB, bw=1280.0MB/s, iops=327680, runt=   100msec
    clat (usec): min=1, max=54, avg= 2.16, stdev= 1.45
     lat (usec): min=1, max=54, avg= 2.29, stdev= 1.50
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[    4], 99.50th=[    7], 99.90th=[   29], 99.95th=[   30],
     | 99.99th=[   39]
    lat (usec) : 2=6.44%, 4=91.48%, 10=1.69%, 20=0.16%, 50=0.23%
    lat (usec) : 100=0.01%
  cpu          : usr=32.32%, sys=64.65%, ctx=94, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=1602KB/s, minb=1602KB/s, maxb=1602KB/s, mint=81817msec, maxt=81817msec
  WRITE: io=131072KB, aggrb=1280.0MB/s, minb=1280.0MB/s, maxb=1280.0MB/s, mint=100msec, maxt=100msec

Disk stats (read/write):
    dm-0: ios=32735/166, merge=0/0, ticks=81216/3440, in_queue=84656, util=99.31%, aggrios=32768/400, aggrmerge=0/17, aggrticks=81264/9468, aggrin_queue=90720, aggrutil=99.23%
  vda: ios=32768/400, merge=0/17, ticks=81264/9468, in_queue=90720, util=99.23%