it-grad_fio_test1.txt
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1
fio-2.10
Starting 2 processes
random-read: Laying out IO file(s) (1 file(s) / 128MB)
random-write: Laying out IO file(s) (1 file(s) / 128MB)

random-read: (groupid=0, jobs=1): err= 0: pid=24087: Tue Nov 28 13:44:59 2017
  read : io=131072KB, bw=10370KB/s, iops=2592, runt= 12640msec
    clat (usec): min=172, max=10204, avg=383.85, stdev=347.45
     lat (usec): min=172, max=10205, avg=384.06, stdev=347.45
    clat percentiles (usec):
     |  1.00th=[  211],  5.00th=[  229], 10.00th=[  237], 20.00th=[  249],
     | 30.00th=[  270], 40.00th=[  322], 50.00th=[  346], 60.00th=[  358],
     | 70.00th=[  370], 80.00th=[  410], 90.00th=[  498], 95.00th=[  620],
     | 99.00th=[ 1608], 99.50th=[ 2416], 99.90th=[ 4960], 99.95th=[ 7008],
     | 99.99th=[10048]
    bw (KB  /s): min= 6954, max=11737, per=91.66%, avg=9504.00, stdev=1350.16
    lat (usec) : 250=21.17%, 500=69.24%, 750=6.41%, 1000=1.28%
    lat (msec) : 2=1.18%, 4=0.55%, 10=0.15%, 20=0.02%
  cpu          : usr=0.66%, sys=4.59%, ctx=32779, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write: (groupid=0, jobs=1): err= 0: pid=24088: Tue Nov 28 13:44:59 2017
  write: io=131072KB, bw=1142.9MB/s, iops=292571, runt=   112msec
    clat (usec): min=1, max=109, avg= 2.88, stdev= 2.29
     lat (usec): min=1, max=109, avg= 2.96, stdev= 2.33
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    8], 99.50th=[   12], 99.90th=[   34], 99.95th=[   39],
     | 99.99th=[   53]
    lat (usec) : 2=0.19%, 4=79.89%, 10=19.23%, 20=0.29%, 50=0.38%
    lat (usec) : 100=0.01%, 250=0.01%
  cpu          : usr=18.02%, sys=79.28%, ctx=144, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=10369KB/s, minb=10369KB/s, maxb=10369KB/s, mint=12640msec, maxt=12640msec
  WRITE: io=131072KB, aggrb=1142.9MB/s, minb=1142.9MB/s, maxb=1142.9MB/s, mint=112msec, maxt=112msec

Disk stats (read/write):
  sda: ios=32458/3, merge=0/8, ticks=12108/0, in_queue=12104, util=95.71%