it-grad_fio_test2.txt
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=psync, iodepth=1
fio-2.10
Starting 2 processes
random-read: Laying out IO file(s) (1 file(s) / 128MB)
random-write: Laying out IO file(s) (1 file(s) / 128MB)

random-read: (groupid=0, jobs=1): err= 0: pid=22292: Tue Nov 28 14:28:39 2017
  read : io=131072KB, bw=8752.8KB/s, iops=2188, runt= 14975msec
    clat (usec): min=166, max=10311, avg=455.17, stdev=428.15
     lat (usec): min=166, max=10311, avg=455.34, stdev=428.16
    clat percentiles (usec):
     |  1.00th=[  197],  5.00th=[  223], 10.00th=[  233], 20.00th=[  247],
     | 30.00th=[  282], 40.00th=[  338], 50.00th=[  358], 60.00th=[  378],
     | 70.00th=[  442], 80.00th=[  498], 90.00th=[  716], 95.00th=[ 1096],
     | 99.00th=[ 2192], 99.50th=[ 2992], 99.90th=[ 5856], 99.95th=[ 6496],
     | 99.99th=[ 8032]
    bw (KB  /s): min= 3799, max=12506, per=96.73%, avg=8465.93, stdev=1834.95
    lat (usec) : 250=21.31%, 500=58.87%, 750=10.81%, 1000=3.05%
    lat (msec) : 2=4.73%, 4=0.97%, 10=0.25%, 20=0.01%
  cpu          : usr=0.80%, sys=3.42%, ctx=32792, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write: (groupid=0, jobs=1): err= 0: pid=22293: Tue Nov 28 14:28:39 2017
  write: io=131072KB, bw=1163.7MB/s, iops=297890, runt=   110msec
    clat (usec): min=1, max=109, avg= 2.85, stdev= 2.49
     lat (usec): min=1, max=109, avg= 2.92, stdev= 2.52
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[   10], 99.50th=[   23], 99.90th=[   33], 99.95th=[   42],
     | 99.99th=[   55]
    lat (usec) : 2=0.35%, 4=81.28%, 10=17.29%, 20=0.54%, 50=0.52%
    lat (usec) : 100=0.02%, 250=0.01%
  cpu          : usr=14.68%, sys=80.73%, ctx=189, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=8752KB/s, minb=8752KB/s, maxb=8752KB/s, mint=14975msec, maxt=14975msec
  WRITE: io=131072KB, aggrb=1163.7MB/s, minb=1163.7MB/s, maxb=1163.7MB/s, mint=110msec, maxt=110msec

Disk stats (read/write):
  sda: ios=32375/2, merge=0/14, ticks=14336/0, in_queue=14332, util=96.38%